//'number' + 3 + 3 -> number33 - конкатенація

//null + 3 -> 3 - це додавання, 0+3=3


/* 5 && "qwerty" -> qwerty - Обидві частини виразу є true, 
тому він виконується та у відповідь повертається остання частина 
(а саме значення другого операнда)*/

/*+'40' + +'2' + "hillel"; -> 42hillel - унарний плюс змінює тип першого 
операнда на number зі string типу, так само і з другим, потім відбувається конкатенація. 
Результат стрінга*/

//'10' - 5 === 6; -> false - string приводиться до числа, 10-5=5 і це не дорівнює 6, тому false

//true + false; -> 1 - це додавання 1+0=1

//'4px' - 3; -> NaN - тому що string не виходить перевести в тип number, а значить не виходить обчислити

//'4' - 3; -> 1 - string конвертується в number і обчислюється 4-3=1

/*'6' + 3 ** 0; -> 61 - спершу розраховується 3 в нульовому ступіні =1, 
далі через конкатенацію string конвертується в number, разом виходить 61 і це string*/

//12 / '6'; -> 2 - поділ, '6' конвертується із string на number, 12/6=2


/*'10' + (5 === 6); -> 10false - порівняння в скобках =false, 
так як 5 не дорівнює 6, при конкатенації до '10' додається false, і разом виходить string*/

//null == ''; -> false - бо null не дорівнює до порожній string

//3 ** (9 / 3); -> 27 - спершу 9/3=3 і 3 в 3-й ступіні дорівнює 27

/*!!'false' == !!'true'; -> true - спершу 'false' string конвертується в boolean, 
також значення не підпадає під виключення отже змінюється з true на false, 
другим знаком оклика змінюється значення на протилежне, тобто true, 
друга частина: 'true' string перетворюється на boolean, так само не підпадає під виключення отже змінюється з true на false, 
другим знаком оклика змінюється значення на протилежне, тобто true, 
тому true дорівнює true і в результаті true*/

//0 || '0' && 1; -> 1 - спершу виконується логічне "і", що дорівнює true=1, далі 0 АБО 1 і ми виводимо 1

/*(+null == false) < 1; -> false - унарний плюс змінює null на number (0), 
0 в свою чергу підпадає під виключення, а отже дорівнює true, і в свою чергу true (1) не є меншим за 1*/

/*false && true || true; -> true - спершу виконується логічне "і" і ця частина дорівнює false. 
Далі виконується логічне "або" і повертає значення другого операнда, тобто true*/

/*false && (false || true); -> false - спершу виконується частина у дужках, 
логічне "або" і результатом буде true. 
Далі виконується логічне "і", першим операндом там є false, тому відповіддю буде false*/

/*(+null == false) < 1 ** 5; -> false - спершу виконується вираз у дужках унарний плюс конвертує null в number (0) 
і результатом буде true. Далі 1 в 5-му ступені дорівнює 1 і true (1) не є меншим за одиницю*/
